app/controllers/school_classes_controller.rb

    def create
        @school_class = SchoolClass.create(school_classes_params(:title, :room_number))
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Biology"], ["room_number", 666], ["created_at", "2020-10-29 21:54:20.403161"], ["updated_at", "2020-10-29 21:54:20.403161"]]

    def update
        @school_class = SchoolClass.update(school_classes_params(:title, :room_number))
---
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Squidward"], ["room_number", 543], ["updated_at", "2020-10-29 22:00:54.596613"], ["id", 1]]