app/controllers/students_controller.rb

    def update
        @student = Student.update(student_params(:first_name, :last_name))
---
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Stinky"], ["last_name", "Peterson"], ["updated_at", "2020-10-29 22:09:24.851188"], ["id", 1]]

    def find_school_class
        @student = Student.find(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]